[
  {
    "title": "Ultimate spaghetti carbonara recipe",
    "ingredients": [
      "100g pancetta",
      "50g pecorino cheese",
      "50g parmesan",
      "3 large eggs",
      "350g spaghetti",
      "2 plump garlic cloves, peeled and left whole",
      "50g unsalted butter",
      "sea salt and freshly ground black pepper"
    ],
    "steps": [
      "Mettez une grande casserole d’eau à ébullition.",
      "Hachez finement 100 g de pancetta en ayant préalablement retiré la croûte. Râpez finement 50 g de pecorino et 50 g de parmesan et mélangez-les.",
      "Battez les 3 gros œufs dans un bol moyen et assaisonnez avec un peu de poivre noir fraîchement râpé. Mettez tout de côté.",
      "Ajoutez 1 cuillère à café de sel à l'eau bouillante, ajoutez 350 g de spaghettis et lorsque l'eau revient à ébullition, faites cuire à ébullition constante, à couvert, pendant 10 minutes ou jusqu'à ce qu'ils soient al dente (juste cuits).",
      "Écrasez 2 gousses d'ail dodues, pelées, avec la lame d'un couteau, histoire de les meurtrir.",
      "Pendant que les spaghettis cuisent, faites revenir la pancetta avec l'ail. Versez 50 g de beurre doux dans une grande poêle ou un wok et, dès que le beurre est fondu, versez-y la pancetta et l'ail.",
      "Laisser cuire à feu moyen environ 5 minutes en remuant souvent jusqu'à ce que la pancetta soit dorée et croustillante. L'ail a maintenant conféré sa saveur, alors retirez-le avec une écumoire et jetez-le.",
      "Gardez le feu doux sous le bacon. Lorsque les pâtes sont prêtes, sortez-les de l'eau avec une fourchette à pâtes ou une pince et mettez-les dans la poêle avec la pancetta. Ne vous inquiétez pas si un peu d'eau tombe également dans la casserole (vous souhaitez que cela se produise) et ne jetez pas encore l'eau des pâtes.",
      "Mélangez la majeure partie du fromage avec les œufs, en gardant une petite poignée pour saupoudrer plus tard.",
      "Retirez la poêle de spaghettis et de pancetta du feu. Maintenant, versez rapidement les œufs et le fromage. À l'aide des pinces ou d'une longue fourchette, soulevez les spaghettis pour qu'ils se mélangent facilement au mélange d'œufs, qui épaissit mais ne se brouille pas, et que le tout soit enrobé.",
      "Ajoutez de l'eau de cuisson supplémentaire pour les pâtes pour les garder en sauce (plusieurs cuillères à soupe devraient suffire). Vous ne voulez pas qu'il soit mouillé, juste humide. Assaisonner avec un peu de sel, si nécessaire.",
      "Utilisez une fourchette à long bec pour tordre les pâtes dans l'assiette ou le bol de service. Servir immédiatement avec un peu de fromage restant et une râpe de poivre noir. Si le plat devient un peu sec avant de servir, ajoutez un peu d'eau chaude pour les pâtes et le goût brillant sera ravivé."
    ]
  }
]
