[
  {
    "index": 0,
    "title": "Ultimate spaghetti carbonara",
    "ingredients": [
      { "id": 100, "name": "100g pancetta" },
      { "id": 200, "name": "50g pecorino cheese" },
      { "id": 300, "name": "50g parmesan" },
      { "id": 400, "name": "3 large eggs" },
      { "id": 500, "name": "350g spaghetti" },
      { "id": 600, "name": "2 plump garlic cloves, peeled and left whole" },
      { "id": 700, "name": "50g unsalted butter" },
      { "id": 800, "name": "sea salt and freshly ground black pepper" }
    ],
    "steps": [
      { "id": 100, "name": "Put a large saucepan of water on to boil." },
      {
        "id": 200,
        "name": "Finely chop the 100g pancetta, having first removed any rind. Finely grate 50g pecorino cheese and 50g parmesan and mix them together."
      },
      {
        "id": 300,
        "name": "Beat the 3 large eggs in a medium bowl and season with a little freshly grated black pepper. Set everything aside."
      },
      {
        "id": 400,
        "name": "Add 1 tsp salt to the boiling water, add 350g spaghetti and when the water comes back to the boil, cook at a constant simmer, covered, for 10 minutes or until al dente (just cooked)."
      },
      {
        "id": 500,
        "name": "Squash 2 peeled plump garlic cloves with the blade of a knife, just to bruise it."
      },
      {
        "id": 600,
        "name": "While the spaghetti is cooking, fry the pancetta with the garlic. Drop 50g unsalted butter into a large frying pan or wok and, as soon as the butter has melted, tip in the pancetta and garlic."
      },
      {
        "id": 700,
        "name": "Leave to cook on a medium heat for about 5 minutes, stirring often, until the pancetta is golden and crisp. The garlic has now imparted its flavour, so take it out with a slotted spoon and discard."
      },
      {
        "id": 800,
        "name": "Keep the heat under the pancetta on low. When the pasta is ready, lift it from the water with a pasta fork or tongs and put it in the frying pan with the pancetta. Don’t worry if a little water drops in the pan as well (you want this to happen) and don’t throw the pasta water away yet."
      },
      {
        "id": 900,
        "name": "Mix most of the cheese in with the eggs, keeping a small handful back for sprinkling over later."
      },
      {
        "id": 1000,
        "name": "Take the pan of spaghetti and pancetta off the heat. Now quickly pour in the eggs and cheese. Using the tongs or a long fork, lift up the spaghetti so it mixes easily with the egg mixture, which thickens but doesn’t scramble, and everything is coated."
      },
      {
        "id": 1100,
        "name": "Add extra pasta cooking water to keep it saucy (several tablespoons should do it). You don’t want it wet, just moist. Season with a little salt, if needed."
      },
      {
        "id": 1200,
        "name": "Use a long-pronged fork to twist the pasta on to the serving plate or bowl. Serve immediately with a little sprinkling of the remaining cheese and a grating of black pepper. If the dish does get a little dry before serving, splash in some more hot pasta water and the glossy sauciness will be revived."
      }
    ]
  },

  {
    "index": 1,
    "title": "12 Chocolate chip muffins",
    "ingredients": [
      { "id": 100, "name": "250g self-raising flour" },
      { "id": 200, "name": "1 tsp bicarbonate of soda" },
      { "id": 300, "name": "150g chocolate chips, milk, white, dark or a mix of all three" },
      { "id": 400, "name": "100g golden caster sugar" },
      { "id": 500, "name": "2 eggs, lightly beaten" },
      { "id": 600, "name": "150ml natural yogurt" },
      { "id": 700, "name": "100g unsalted butter, melted" }
    ],
    "steps": [
      { "id": 100, "name": "Heat the oven to 200C/180C fan/gas 6 and line a 12-hole muffin tin with paper cases." },
      {
        "id": 200,
        "name": "Sift the flour and bicarbonate of soda into a large bowl."
      },
      {
        "id": 300,
        "name": "Stir in the chocolate chips and sugar."
      },
      {
        "id": 400,
        "name": "Add the beaten eggs, yogurt and butter, and stir to combine. It doesn’t matter if the mixture looks a bit lumpy, it’s more important not to overmix or the muffins will turn out tough."
      },
      {
        "id": 500,
        "name": "Fill the paper cases and bake for 20-25 mins until risen and golden brown."
      },
      {
        "id": 600,
        "name": "Transfer to a rack to cool – or eat slightly warm. Will keep in an airtight container for three days."
      }
    ]
  },

  {
    "index": 2,
    "title": "Sweet potato & lentil soup",
    "ingredients": [
      { "id": 100, "name": "2 tsp medium curry powder" },
      { "id": 200, "name": "3 tbsp olive oil" },
      { "id": 300, "name": "2 onions, grated" },
      { "id": 400, "name": "1 eating apple, peeled, cored and grated" },
      { "id": 500, "name": "3 garlic cloves, crushed" },
      { "id": 600, "name": "20g pack coriander, stalks chopped" },
      { "id": 700, "name": "thumb-size piece fresh root ginger, grated" },
      { "id": 800, "name": "800g sweet potatoes" },
      { "id": 900, "name": "1.2l low-sodium vegetable stock" },
      { "id": 1000, "name": "100g red lentils" },
      { "id": 1100, "name": "300ml milk" },
      { "id": 1200, "name": "juice 1 lime" }
    ],

    "steps": [
      { "id": 100, "name": "Put the curry powder into a large saucepan, then toast over a medium heat for 2 mins." },
      {
        "id": 200,
        "name": " Add the olive oil, stirring as the spice sizzles in the pan. Tip in the onions, apple, garlic, coriander stalks and ginger, season, then gently cook for 5 mins, stirring every so often."
      },
      {
        "id": 300,
        "name": "Meanwhile, peel, then grate the sweet potatoes. Tip into the pan with the stock, lentils, milk and seasoning, then simmer, covered, for 20 mins."
      },
      {
        "id": 400,
        "name": "Blend until smooth using a stick blender."
      },
      {
        "id": 500,
        "name": "Stir in the lime juice, check the seasoning and serve, topped with roughly-chopped coriander leaves."
      }
    ]
  }
]
